"""
Определите количество девятеричных
шестизначных чисел,
в записи которых не более двух цифр 4.

Ответ: 461824
"""
import math
# n1=[1,2,3,,5,6,7,8]= tut 4 = 1
# n2=[0,1,2,3,,5,6,7,8]= tut 4 = 1*5 variantov
# n3=[0,1,2,3,,5,6,7,8]
# n4=[0,1,2,3,,5,6,7,8]
# n5=[0,1,2,3,,5,6,7,8]
# n6=[0,1,2,3,,5,6,7,8]

# n-место,v-вариант
# v1 четверки нет
# v2 четверка одна и ее место 1
# v3 четверка одна и ее место 2/3/4/5/6
# v4 четверок две и их места 1 и 2/3/4/5/6
# v5 четверок две и их месте 2/3/4/5/6 и 2/3/4/5/6

v1=7*8**5
v2=1*8**5
v3=7*1*5*8**4
v4=1*1*5*8**4
v5=7*math.comb(5,2)*8**3

print(v1+v2+v3+v4+v5)
